{
    "t5": {
        "return_dict": true,
        "output_hidden_states": false,
        "output_attentions": false,
        "torchscript": false,
        "torch_dtype": null,
        "use_bfloat16": false,
        "pruned_heads": {},
        "tie_word_embeddings": true,
        "is_encoder_decoder": true,
        "is_decoder": false,
        "cross_attention_hidden_size": null,
        "add_cross_attention": false,
        "tie_encoder_decoder": false,
        "max_length": 20,
        "min_length": 0,
        "do_sample": false,
        "early_stopping": false,
        "num_beams": 1,
        "num_beam_groups": 1,
        "diversity_penalty": 0.0,
        "temperature": 1.0,
        "top_k": 50,
        "top_p": 1.0,
        "typical_p": 1.0,
        "repetition_penalty": 1.0,
        "length_penalty": 1.0,
        "no_repeat_ngram_size": 0,
        "encoder_no_repeat_ngram_size": 0,
        "bad_words_ids": null,
        "num_return_sequences": 1,
        "chunk_size_feed_forward": 0,
        "output_scores": false,
        "return_dict_in_generate": false,
        "forced_bos_token_id": null,
        "forced_eos_token_id": null,
        "remove_invalid_values": false,
        "exponential_decay_length_penalty": null,
        "architectures": [
            "T5WithLMHeadModel"
        ],
        "finetuning_task": null,
        "id2label": {
            "0": "LABEL_0",
            "1": "LABEL_1"
        },
        "label2id": {
            "LABEL_0": 0,
            "LABEL_1": 1
        },
        "tokenizer_class": null,
        "prefix": null,
        "bos_token_id": null,
        "pad_token_id": 0,
        "eos_token_id": 1,
        "sep_token_id": null,
        "decoder_start_token_id": 0,
        "task_specific_params": {
            "summarization": {
                "early_stopping": true,
                "length_penalty": 2.0,
                "max_length": 200,
                "min_length": 30,
                "no_repeat_ngram_size": 3,
                "num_beams": 4,
                "prefix": "summarize: "
            },
            "translation_en_to_de": {
                "early_stopping": true,
                "max_length": 300,
                "num_beams": 4,
                "prefix": "translate English to German: "
            },
            "translation_en_to_fr": {
                "early_stopping": true,
                "max_length": 300,
                "num_beams": 4,
                "prefix": "translate English to French: "
            },
            "translation_en_to_ro": {
                "early_stopping": true,
                "max_length": 300,
                "num_beams": 4,
                "prefix": "translate English to Romanian: "
            }
        },
        "problem_type": null,
        "_name_or_path": "t5-small",
        "transformers_version": "4.18.0",
        "vocab_size": 32128,
        "max_position_embeddings": 512,
        "hidden_size": 512,
        "retriever_proj_size": 128,
        "num_hidden_layers": 12,
        "num_attention_heads": 12,
        "num_candidates": 8,
        "intermediate_size": 3072,
        "hidden_act": "gelu_new",
        "hidden_dropout_prob": 0.1,
        "attention_probs_dropout_prob": 0.1,
        "initializer_range": 0.02,
        "type_vocab_size": 2,
        "layer_norm_eps": 1e-12,
        "span_hidden_size": 256,
        "max_span_width": 10,
        "reader_layer_norm_eps": 0.001,
        "reader_beam_size": 15,
        "reader_seq_len": 320,
        "num_block_records": 12039,
        "searcher_beam_size": 15,
        "searcher_seq_len": 64,
        "projected_size": 512,
        "d_model": 512,
        "d_kv": 64,
        "d_ff": 2048,
        "num_layers": 6,
        "num_decoder_layers": 6,
        "num_heads": 8,
        "relative_attention_num_buckets": 32,
        "relative_attention_max_distance": 128,
        "dropout_rate": 0.1,
        "layer_norm_epsilon": 1e-06,
        "initializer_factor": 1.0,
        "feed_forward_proj": "relu",
        "use_cache": true,
        "model_type": "realm",
        "n_positions": 512,
        "output_past": true,
        "max_knowledge_length": 96,
        "max_source_length": 130
    },
    "trainer": {
        "name": "experiment02",
        "predict": false,
        "evaluate": false,
        "model": "realm-t5-generator",
        "acc_func": "token-accuracy",
        "loss_func": "cross-entropy",
        "large_dataset": false,
        "num_workers": 4,
        "training_dataset": "data/train_sample.json",
        "validation_dataset": "data/train_sample.json",
        "test_dataset": "data/train_sample.json",
        "label_path": false,
        "tokenizer_path": "t5-small",
        "weights": "t5-small",
        "all_save": false,
        "save_path": "checkpoint",
        "load_path": "checkpoint/trained_model/",
        "result_path": "test_predict.jsonl",
        "learning_rate": 0.0001,
        "epoch": 100,
        "patience": 10,
        "batch_size": 16,
        "max_knowledge_length": 96,
        "max_source_length": 130,
        "max_target_length": 30,
        "classifier_dropout": 0.1,
        "focal_gamma": 0,
        "reader_beam_size": 15,
        "searcher_beam_size": 15,
        "additional_documents_path": "data/knowledge_sample.txt",
        "update_step": 100,
        "projected_size": 512,
        "early_stopping": false,
        "do_sample": true,
        "top_k": 50,
        "top_p": 0.9,
        "repetition_penalty": 1.0,
        "length_penalty": 1.0,
        "diversity_penalty": 0.0,
        "num_beams": 5,
        "temperature": 1.0,
        "max_length": 30,
        "min_length": 3,
        "num_return_sequences": 3,
        "save_every_n_steps": 20000,
        "logging_steps": 100
    }
}
